In [1]:
import pandas as pd

# Estoque

In [2]:
df_estoque = pd.read_csv('../data/raw/tb_estoques.csv')
df_estoque.head()

   key_loja  cod_produto  dt_estoque  qt_estoque
0         1         1428  2024-03-18         108
1         1         1428  2024-12-13          24
2         1         1428  2024-07-30          33
3         1         1428  2024-07-22          34
4         1         1428  2024-07-29          34

# Similares

In [3]:
df_similares = pd.read_csv('../data/raw/tb_similares.csv')
df_similares.head()

   cod_material  cod_material_recom  ranking
0         48635               25472        1
1         50651               74932        1
2         48062               77684        1
3         49893               48730        1
4         49943               84203        1

# Vendas

In [4]:
df_vendas = pd.read_csv('../data/raw/tb_vendas.csv')
df_vendas.head()

,dt_venda,cod_pedido,canal,des_estado_franquia,key_loja,cod_material,categoria_produto,sub_categoria_produto,linha_produto,vlr_venda_tabelado,vlr_desconto
0,2024-05-10,386761455,FISCO,SP,1,1428,217.0,422944,731659,248.7,0.00
1,2024-03-25,377623716,DIGITAL,SP,1,1428,217.0,422944,731659,248.7,88.23
2,2024-03-19,376372149,DIGITAL,SP,1,1428,217.0,422944,731659,248.7,88.23
3,2024-10-23,414882456,DIGITAL,SP,1,1428,217.0,422944,731659,248.7,0.00
4,2024-02-27,371457908,DIGITAL,SP,1,1428,217.0,422944,731659,230.7,0.00

In [13]:
df_vendas['dt_venda'].min(), df_vendas['dt_venda'].max()

('2024-01-02', '2024-12-31')

In [5]:
df_vendas['canal'].value_counts()

canal
FISCO      121822
DIGITAL     82070
Name: count, dtype: int64

In [6]:
df_vendas['des_estado_franquia'].value_counts()

des_estado_franquia
MG    71381
SE    46946
SP    39958
PR    19207
AL    15988
GO    10412
Name: count, dtype: int64

In [7]:
df_vendas['categoria_produto'].value_counts()

categoria_produto
217.0       151058
157293.0     50459
955075.0      2318
415068.0        23
Name: count, dtype: int64

In [8]:
df_vendas['sub_categoria_produto'].value_counts()

sub_categoria_produto
422944    149451
483679     43414
311781      8892
32688       2101
69341         34
Name: count, dtype: int64

In [9]:
df_vendas['linha_produto'].value_counts()

linha_produto
731659    67869
306420    47599
390554    34482
284036    18860
85436      8665
200277     6366
736254     4357
264366     4198
212257     3556
109471     2753
120030     2083
147447     1537
504928      776
511346      310
22428       261
880502      147
964633       34
991747       34
18214         5
Name: count, dtype: int64

In [11]:
df_vendas[['vlr_venda_tabelado', 'vlr_desconto']].describe()

       vlr_venda_tabelado   vlr_desconto
count       203892.000000  203622.000000
mean           511.179565      88.904899
std           1571.562003     476.918028
min            134.700000       0.000000
25%            230.700000       0.000000
50%            389.700000      29.940000
75%            497.400000      97.140000
max         284415.300000   86711.040000